In [4]:
import pandas as pd
import numpy as np

In [ ]:
# create series
data=[1,2,3,4,5]
series=pd.Series(data)

In [7]:
print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [9]:
## Create series from dictionary
data={'a':1,'b':2,'c':3,'d':4}
series=pd.Series(data)
print(series)

a    1
b    2
c    3
d    4
dtype: int64

In [10]:
data=[1,2,3,4,5]
index=['a','b','c','d','e']
series=pd.Series(data,index=index)
print(series)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [13]:
##DataFrame
# Create a dataFrame from the dictionary
data={
    'name':['Nagendra','Harish','Hemanth'],
    'age':[23,32,26],
    'village':['kuruburu','konganapalli','dayalapalli']
}
df=pd.DataFrame(data)
print(df)

       name  age       village
0  Nagendra   23      kuruburu
1    Harish   32  konganapalli
2   Hemanth   26   dayalapalli

In [15]:
import numpy as np
np.array(df)

array([['Nagendra', 23, 'kuruburu'],
       ['Harish', 32, 'konganapalli'],
       ['Hemanth', 26, 'dayalapalli']], dtype=object)

In [16]:
df['name']

0    Nagendra
1      Harish
2     Hemanth
Name: name, dtype: object

In [18]:
df.loc[0]

name       Nagendra
age              23
village    kuruburu
Name: 0, dtype: object

In [23]:
df.at[0,'name']

'Nagendra'

In [24]:
df.iat[0,0]

'Nagendra'

In [ ]:
#adding column
df['salary']=[50,60,70]

In [26]:
df

       name  age       village  salary
0  Nagendra   23      kuruburu      50
1    Harish   32  konganapalli      60
2   Hemanth   26   dayalapalli      70

In [ ]:
## Remove column temporarly
df.drop('salary',axis=1)

       name  age       village
0  Nagendra   23      kuruburu
1    Harish   32  konganapalli
2   Hemanth   26   dayalapalli

In [33]:
df

       name  age       village  salary
0  Nagendra   23      kuruburu      50
1    Harish   32  konganapalli      60
2   Hemanth   26   dayalapalli      70

In [34]:
## Remove column
df.drop('salary',axis=1,inplace=True)

In [35]:
df

       name  age       village
0  Nagendra   23      kuruburu
1    Harish   32  konganapalli
2   Hemanth   26   dayalapalli